run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/usun/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "290.1";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
1.95397
1.95397
1.95397
1.95397
1.95397
1.95397
1.95397
1.95397
...
)
;

boundaryField
{
    UP
    {
        type            fixedValue;
        value           uniform 1.95;
    }
    DOWN
    {
        type            fixedValue;
        value           uniform 1.95397;
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
