run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/usun/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "290.1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
40000
(
(0.00587727 -0.00253962 0)
(0.012188 0.000523017 0)
(0.0114826 0.000587025 0)
(0.010064 0.000493552 0)
(0.00892472 0.000319514 0)
(0.00785066 0.000185668 0)
(0.00685685 0.000114122 0)
(0.00596204 8.27397e-05 0)
...
)
;

boundaryField
{
    UP
    {
        type            superFluidWall;
        value           nonuniform List<vector> 
50
(
(-1.83446e-06 0 0)
(-6.54772e-07 0 0)
(5.72971e-07 0 0)
(-2.55117e-07 0 0)
(-6.56918e-08 0 0)
(-3.66492e-07 0 0)
(-1.83602e-07 0 0)
(-3.72216e-07 0 0)
...
)
;
    }
    DOWN
    {
        type            superFluidWall;
        value           nonuniform List<vector> 
50
(
(0.00101325 0 0)
(0.00085708 0 0)
(4.92724e-05 0 0)
(0.000156268 0 0)
(0.000171634 0 0)
(0.000123346 0 0)
(8.85753e-05 0 0)
(6.38833e-05 0 0)
...
)
;
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            superFluidWall;
        value           nonuniform List<vector> 
1600
(
(0 -0.0181445 0)
(0 -0.0181856 0)
(0 -0.0183854 0)
(0 -0.0184517 0)
(0 -0.0185085 0)
(0 -0.0185381 0)
(0 -0.018564 0)
(0 -0.0185856 0)
...
)
;
    }
}


// ************************************************************************* //
