run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/usun/0/Un
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "290.1";
    object      Un;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
40000
(
(0.00484911 0.0155861 0)
(0.0113396 0.0194591 0)
(0.0114333 0.0194657 0)
(0.00990782 0.0192556 0)
(0.00875308 0.0190943 0)
(0.00772726 0.0189767 0)
(0.00676824 0.0189075 0)
(0.00589814 0.0188771 0)
...
)
;

boundaryField
{
    UP
    {
        type            superFluidWallUn;
        value           nonuniform List<vector> 
50
(
(0 0.0188307 0)
(0 0.0188313 0)
(0 0.0188312 0)
(0 0.018831 0)
(0 0.0188309 0)
(0 0.0188308 0)
(0 0.0188308 0)
(0 0.0188309 0)
...
)
;
    }
    DOWN
    {
        type            superFluidWallUn;
        value           nonuniform List<vector> 
50
(
(-0 0.0182598 -0)
(-0 0.0188389 -0)
(-0 0.0188939 -0)
(-0 0.0187596 -0)
(-0 0.0187753 -0)
(-0 0.0187945 -0)
(-0 0.0187962 -0)
(-0 0.0187965 -0)
...
)
;
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            superFluidWallUn;
        value           nonuniform List<vector> 
1600
(
(-0.000191214 0 0)
(-0.000343324 0 0)
(-0.000255153 0 0)
(-0.000189002 0 0)
(-0.000134825 0 0)
(-0.000102504 0 0)
(-8.01567e-05 0 0)
(-6.35694e-05 0 0)
...
)
;
    }
}


// ************************************************************************* //
