run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/usun/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "290.1";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
40000
(
(0.00715579 -0.0250788 0)
(0.0132429 -0.0230238 0)
(0.011544 -0.0228884 0)
(0.0102583 -0.0228368 0)
(0.00913816 -0.0230267 0)
(0.00800409 -0.0231807 0)
(0.00696702 -0.0232552 0)
(0.0060415 -0.0232878 0)
...
)
;

boundaryField
{
    UP
    {
        type            superFluidWallUs;
        value           nonuniform List<vector> 
50
(
(-4.05845e-06 -0.0228291 0)
(-1.44858e-06 -0.0228299 0)
(1.2676e-06 -0.0228298 0)
(-5.64405e-07 -0.0228295 0)
(-1.45332e-07 -0.0228293 0)
(-8.10804e-07 -0.0228293 0)
(-4.0619e-07 -0.0228293 0)
(-8.23468e-07 -0.0228293 0)
...
)
;
    }
    DOWN
    {
        type            superFluidWallUs;
        value           nonuniform List<vector> 
50
(
(0.00227323 -0.022706 0)
(0.00192285 -0.023426 0)
(0.000110542 -0.0234944 0)
(0.000350586 -0.0233274 0)
(0.000385058 -0.023347 0)
(0.000276725 -0.0233708 0)
(0.000198718 -0.0233729 0)
(0.000143322 -0.0233733 0)
...
)
;
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            superFluidWallUs;
        value           nonuniform List<vector> 
1600
(
(0.000237772 -0.040707 0)
(0.000426918 -0.0407991 0)
(0.000317276 -0.0412471 0)
(0.000235018 -0.0413959 0)
(0.00016765 -0.0415232 0)
(0.00012746 -0.0415894 0)
(9.96709e-05 -0.0416473 0)
(7.90449e-05 -0.0416958 0)
...
)
;
    }
}


// ************************************************************************* //
