run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/usun/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "290.1";
    object      nu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
9.88473e-09
9.88473e-09
9.88473e-09
9.88473e-09
9.88473e-09
9.88473e-09
9.88473e-09
9.88473e-09
...
)
;

boundaryField
{
    UP
    {
        type            calculated;
        value           uniform 9.84054e-09;
    }
    DOWN
    {
        type            calculated;
        value           uniform 9.88473e-09;
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
9.88473e-09
9.88472e-09
9.88471e-09
9.8847e-09
9.88469e-09
9.88468e-09
9.88467e-09
9.88466e-09
...
)
;
    }
}


// ************************************************************************* //
