run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/usun/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "290.1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
-0.00891308
-0.00906713
-0.00906344
-0.00906938
-0.00908506
-0.00909663
-0.00910446
-0.00911032
...
)
;

boundaryField
{
    UP
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
50
(
-9.81015
-9.80987
-9.80999
-9.81003
-9.81
-9.80999
-9.80999
-9.80999
...
)
;
        value           nonuniform List<scalar> 
50
(
-1.97092
-1.97092
-1.97092
-1.97092
-1.97092
-1.97092
-1.97092
-1.97092
...
)
;
    }
    DOWN
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
50
(
9.59234
9.97252
9.79147
9.80169
9.80942
9.80666
9.80681
9.80747
...
)
;
        value           nonuniform List<scalar> 
50
(
-0.00872418
-0.00887075
-0.00887062
-0.00887636
-0.00889189
-0.00890351
-0.00891134
-0.00891719
...
)
;
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
1600
(
0.068577
0.123717
0.0939591
0.0700956
0.0503078
0.0383689
0.0300869
0.0239161
...
)
;
        value           nonuniform List<scalar> 
1600
(
-0.00890622
-0.00931242
-0.00972264
-0.010133
-0.0105402
-0.010946
-0.0113511
-0.0117562
...
)
;
    }
}


// ************************************************************************* //
