run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/usun/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  HeliumConstRho;

simplifiedSuperFluid  Pietrowicz;

HeliumConstCoeffs
{
	TMean            [0 0 0 1 0 0 0] 1.95;
}

HeliumConstRhoCoeffs
{
}
//HeliumCoeffs
//{
//	// Mean helium density
//	rhoHe             rhoHe    [1 -3 0 0 0 0 0]  147.0;
//}
superFluidWallCoeffs
{
}

KitamuraCoeffs
{
}
PietrowiczCoeffs
{
	GM	on;
}

// hel w temp. 1.95 K
//nu              [0 2 -1 0 0 0 0] 0.00000000984449; 


// Needed for turbulentHeatFluxTemperature BC
//rhoCp0           667642.820509542; // [1 -1 -2 -1 0 0 0]

// Laminar Prandtl number
//Pr              [0 0 0 0 0 0 0] 1;// solver crashes if it is 0

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 0.7;

// Reference temperature
TRef            [0 0 0 1 0 0 0] 1.95;

// ************************************************************************* //
