run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Pietrowicz/usun/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Phi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
		maxIter			150;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.0;
//		maxIter			450;
		minIter			5;

//        smoother         DICGaussSeidel;
        smoother         GaussSeidel;

		nPreSweeps		0;
		nPostSweeps		2;
		nFinestSweeps		2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 200;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.0;
//		maxIter			450;
		minIter			5;

//        smoother         DICGaussSeidel;
        smoother         GaussSeidel;

		nPreSweeps		0;
		nPostSweeps		2;
		nFinestSweeps		2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 200;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }
//    p
//    {
//        solver          PCG;
//		preconditioner	DIC;
//        tolerance       1e-06;
//		minIter			3;
//		maxIter			150;
//        relTol          0.1;
//    }
//    p
//    {
//        solver          smoothSolver;
//        smoother        symGaussSeidel;
//        tolerance       1e-06;
//        relTol          0.1;
//		maxIter			150;
//    }

    p_rghFinal
    {
        $p;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

//    "(U|k|epsilon)"
//    {
//        solver          PBiCG;
//		preconditioner	DILU;
//        tolerance       1e-06;
//		maxIter			150;
//        relTol          0.1;
//    }
    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
		maxIter			150;
		minIter			5;
        relTol          0.1;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }

    T
    {
//        solver          smoothSolver;
        solver          PCG;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
		maxIter			150;
		minIter			5;

		nTSubCycles     1;
    }
    TFinal
    {
        solver          smoothSolver;
//        solver          GAMG;
//        solver          PBiCG;
		preconditioner	DILU;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
		maxIter			150;
		minIter			5;

		nPreSweeps		0;
		nPostSweeps		2;
		nFinestSweeps		2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 200;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 1;
}
PIMPLE
{
    nCorrectors         1;
	nOuterCorrctors     200;
    nNonOrthogonalCorrectors 1;
	momentumPredictor	on;

    pRefCell 0; 
	pRefValue 0; 
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    residualControl
    {
        p               1e-6;
        T               1e-6;
        U               1e-6;
        "(k|epsilon|omega)"   1e-6;
    }
}

cache
{
    grad(U);
}

relaxationFactors
{
	fields
	{
		p		0.3;
		pFinal	1;
        T               1;
        TFinal          1;
	}

    equations
    {
		"U|k|epsilon|omega"			0.3;
		"(U|k|epsilon|omega)Final"    1;
		T				0.1;
        ”T.*”           1;
        ”U.*”           0.7;
        ”k.*”           1;
        ”epsilon.*”     1;
        ”omega.*”       1;
    }
}


// ************************************************************************* //
